## This nb describes the following
## Read from csv
## Access some rows and columns
## Do slicing
## change columns names of all or only some
## set index while reading, remove index, and set new index

In [1]:
import numpy as np
import pandas as pd
import pandas.io
print(pandas.io)

<module 'pandas.io' from 'c:\\python36\\lib\\site-packages\\pandas\\io\\__init__.py'>

In [163]:
df1=pd.read_csv("grades.csv")
df1

         Name      Region            Subject  Marks Grade
0        John   Bangalore    Data Structures     80     B
1       Raman     Chennai    Data Structures     70     C
2      Venkat   Bangalore                  C     90     A
3        Rani       Delhi    Data Structures     95     A
4     Lakshmi      Mumbai         Algorithms     90     A
5        Syed     Kolkata          Compilers     92     A
6        Alok     Kolkata           Automata     80     B
7        Mehr      Mumbai    Data Structures     45     D
8     Abraham     Chennai         Algorithms     96     A
9         Jos   Bangalore          Compilers     59     D
10       Amit       Patna           Automata     79     C
11    Krishna   Hyderabad               Java     60     C
12      Sumit        Pune             Python     55     D
13     Jessie  Chandigarh             Python     12     F
14  Jaswinder  Chandigarh               Java     87     B
15  Rodriques         Goa              Scala     75     C
16      Vijay       Kochi  Operating Systems     60     C
17      Stran     Manipur               DBMS     35     D
18       Mani  Darjeeling           Automata     28     F
19     Govind       Simla    Data Structures     39     D
20    Sridhar        Ooty         Algorithms     80     B

In [164]:
df1.head()# by default show details of first 5 rows

      Name     Region          Subject  Marks Grade
0     John  Bangalore  Data Structures     80     B
1    Raman    Chennai  Data Structures     70     C
2   Venkat  Bangalore                C     90     A
3     Rani      Delhi  Data Structures     95     A
4  Lakshmi     Mumbai       Algorithms     90     A

In [165]:
df1.tail() # default show details of last 5 rows)
df1.columns

Index(['Name', 'Region', 'Subject', 'Marks', 'Grade'], dtype='object')

In [ ]:
df1.head(10)

In [ ]:
df1["Name"] #Get specific columns

In [ ]:
df1[["Name", "Grade"]] #Put all the columns in a list

In [ ]:
df1[["Name", "Grade"]][4:9] #Put all the columns in a list

In [ ]:
df1.info() #gives info about the df

In [ ]:
df1.shape

In [ ]:
df1.describe() #Gives some statistical info like, mean, count, min, maxdf1.describe

In [ ]:
df1.describe (percentiles=[0.01, 0.1, 0.5, 0.9])

In [ ]:
df1["Grade"].value_counts()

In [ ]:
df1["Grade"].mode()

In [ ]:
df1.columns

In [ ]:
df1.index

In [ ]:
#change column names: 
df1.columns = ["Name", "City", "Sub", "ScoreOutOf100", "Grades"]
df1

In [ ]:
df1.sum()

In [ ]:
df1["ScoreOutOf100"].sum()

In [ ]:
df1.idxmin()

In [ ]:
df1.index

In [ ]:
df1["Grades"][0]

In [ ]:
df1["Grades"].unique()

In [ ]:
df1["City"].unique()

In [ ]:
#Now read a csv file without header, it creates default col header 0, 1, 2, 3, 4
df2 = pd.read_csv("GradesNoHeader.csv", header=None)
df2

In [ ]:
#Now read the same csv file with no header but provide columns
#2 Methods. Use a dictionary mapping old names to new names
dfCols = pd.read_csv("GradesNoHeader.csv", header=None)
dfCols.rename(columns={0:"Name", 1:"City", 2:"Sub", 3:"Score", 4:"Grade"}, inplace=True)
dfCols

In [ ]:
#Now read the same csv file with no header but provide columns
#2 Methods. Use a dictionary mapping old names to new names. Map only a few old columns
dfCols = pd.read_csv("GradesNoHeader.csv", header=None,)
dfCols.rename(columns={0:"Name", 1:"City", 2:"Sub",  4:"Grade"}, inplace=True)
#old col 0, 1, 2, 4 replaced with Name, City, Sub, Grade
dfCols

In [ ]:
#2nd Method
#Set columns member variable explictily
dfCols.columns=["name1", "city1", "sub1", "Marks1", "gra1"]
dfCols

In [ ]:
dfCols = pd.read_csv("GradesNoHeader.csv", header=None, index_col=0)
dfCols.head()

In [ ]:
#First remove the index by calling reset_index()
dfCols.reset_index(inplace=True)
dfCols.head()

In [ ]:
#Now rename columns to A, B, C,D,E
dfCols.columns=["A", "B", "C", "D", "E"]
dfCols.head()

In [ ]:
#Now Set index to column A
dfCols.set_index("A", inplace=True, drop =True)
dfCols.head()

In [ ]:
#now change the index
#First remove existing index
dfCols.reset_index(inplace=True)
dfCols.head()

In [ ]:
#Put a new index
dfCols.set_index("B", drop=True, inplace=True)
dfCols.head()

In [ ]:
dfCols

In [153]:
dfCols [0:10]

                 A                C   D  E
B
Bangalore     John  Data Structures  80  B
Chennai      Raman  Data Structures  70  C
Bangalore   Venkat                C  90  A
Delhi         Rani  Data Structures  95  A
Mumbai     Lakshmi       Algorithms  90  A
Kolkata       Syed        Compilers  92  A
Kolkata       Alok         Automata  80  B
Mumbai        Mehr  Data Structures  45  D
Chennai    Abraham       Algorithms  96  A
Bangalore      Jos        Compilers  59  D

In [156]:
dfCols[["A","C"]][1:8]

                 A                C
B
Chennai      Raman  Data Structures
Bangalore   Venkat                C
Delhi         Rani  Data Structures
Mumbai     Lakshmi       Algorithms
Kolkata       Syed        Compilers
Kolkata       Alok         Automata
Mumbai        Mehr  Data Structures

In [161]:
dfCols["D"].head()

B
Bangalore    80
Chennai      70
Bangalore    90
Delhi        95
Mumbai       90
Name: D, dtype: int64